# Set Theory in SQL: Classlist Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge set theory through the use of SQL queries.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question has also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I AZABENATHI, PUPUMA, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The Classlist Database

![Hi](https://upload.wikimedia.org/wikipedia/commons/3/39/Student_in_Class_%283618969705%29.jpg)

The Classlist database contains the records of multiple students who have undertaken primary and supplementary examinations in multiple subjects. This data is split across two tables: 

 - **Exammarks**; and 
 - **Supplementarymarks**

Unlike our previous challenge, we leave it up to you to investigate the contents of these tables and the various attributes they contain.

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment. You can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `classlist.db`sqlite file from Athena and have stored it in a known location. 

Now that you have all the prerequistes you can go ahead and load it into the notebook.

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///classlist.db

## Questions on Set Theory 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 2**

How many students did not write any of their final exams?

**Options:** 
 - 5
 - 95
 - 70
 - 25

**Solution**

In [3]:
%%sql 

SELECT count(*) AS non_writers
FROM (
    SELECT StudentNo, name, surname, gender
    FROM supplementarymarks 
    EXCEPT
    SELECT studentno, name, surname, gender
    FROM exammarks
)

 * sqlite:///classlist.db
Done.

[(5,)]

**Question 4**

What are the names of the students in the grade who scored the highest marks for Science? _(hint: you need to consider the exam AND supplementary exam marks)_

**Options:**
 - Jack and Jane
 - Joe and Duane
 - Leroy and Harold
 - Craig and Danielle

**Solution**

In [4]:
%%sql 
SELECT name, science
FROM exammarks
UNION
SELECT name, science
FROM supplementarymarks
ORDER BY science DESC
LIMIT 2;

 * sqlite:///classlist.db
Done.

[('CRAIG', 100), ('DANIELLE', 100)]

**Question 5**

How many students had to re-write their Maths and science exam? *(hint: a passing mark is considered to be 50 or greater)*

**Options:**
 - 12
 - 4
 - 20
 - 9

**Solution**

In [5]:
%%sql 

SELECT count(*) AS math_sci_count
FROM exammarks
WHERE maths < 50 AND science < 50

 * sqlite:///classlist.db
Done.

[(4,)]

**Question 6**

What was the average mark, rounded down, for students who wrote the supplementary accounting exam after missing the first?

**Options:**
 - 73
 - 79
 - 76
 - 82

**Solution**

In [6]:
%%sql 

WITH non_writers AS (
    SELECT StudentNo, name, surname, gender
    FROM supplementarymarks 
    EXCEPT
    SELECT studentno, name, surname, gender
    FROM exammarks
    )
SELECT FLOOR(AVG(accounting)) AS no_exam_acc_avg
FROM supplementarymarks s
JOIN non_writers n
ON n.studentno = s.studentno

 * sqlite:///classlist.db
Done.

[(76,)]

**Question 7**

What was the average mark, rounded down, for students who wrote the supplementary accounting exam after failing the first?

**Options:**
 - 79
 - 82
 - 76
 - 73

**Solution**

In [7]:
%%sql 

SELECT FLOOR((sum(accounting)-5*76)/(count(accounting)-5)) AS re_write_acc_avg
FROM supplementarymarks

 * sqlite:///classlist.db
Done.

[(73,)]

**Question 9**

What is the Full name of the student in the grade who scored the highest mark for Biology? *(hint: consider both supplementary and exam marks)*
 
 **Options:**
 - Tracy Grady
 - Bertha Hoff
 - Daryl Finn
 - Lillie Deaton

**Solution**

In [8]:
%%sql 

SELECT name || ' ' || surname AS FullName
FROM (
    SELECT *
    FROM exammarks
    UNION
    SELECT *
    FROM supplementarymarks
    ORDER BY biology DESC
    LIMIT 1
)

 * sqlite:///classlist.db
Done.

[('TRACY GRADY',)]

**Question 10**

Assuming all subjects are weighted equally, what was the average total mark, rounded down, for students who didn’t write any supplementary exams?
 
**Options:**
 - 74
 - 66
 - 73
 - 76

**Solution**

In [12]:
%%sql 

SELECT FLOOR((avg(maths) + avg(science) + avg(biology) + avg(accounting) + avg(compsci))/5) AS total_mark_average
FROM exammarks
WHERE maths > 50 AND science > 50 AND biology > 50 AND accounting > 50 AND compsci > 50;

 * sqlite:///classlist.db
Done.

[(76,)]